In [1]:
#PART 1

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  1  1  7  8
1  4  9  2  5  1
2  7  1  3  8  4
3  1  1  2  3  6
4  6  8  1  5  2

In [4]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [5]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        2        1        1        7        8
1        4        9        2        5        1
2        7        1        3        8        4
3        1        1        2        3        6
4        6        8        1        5        2

In [6]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        2        1        1        7        8
1        4        9        2        5        1
2        7        1        3        8        4
3        1        1        2        3        6
4        6        8        1        5        2

In [7]:
#PART 2

In [8]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [9]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  2  1  4  1
1  1  1  2  2  3
2  2  3  4  2  3
3  2  4  4  2  3
4  4  4  1  3  4
5  2  4  2  1  2
6  4  4  4  4  4
7  4  4  2  3  4
8  3  3  2  1  1
9  3  3  1  4  3

In [10]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  1  1  2  2  3
8  3  3  2  1  1
9  3  3  1  4  3

In [11]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  1  1  2  2  3
8  3  3  2  1  1
9  3  3  1  4  3

In [12]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  2  1  4  1
2  2  3  4  2  3
3  2  4  4  2  3
4  4  4  1  3  4
5  2  4  2  1  2
6  4  4  4  4  4
7  4  4  2  3  4

In [13]:
#PART 3

In [14]:
import pandas as pd

print(pd.__version__)

2.3.3

In [15]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [16]:
df.dtypes

col1    object
col2    object
dtype: object

In [17]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [18]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [19]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [20]:
#PART 4

In [21]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [22]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         14.0         12    A
1 2024-10-01 01:00:00         13.0          3    B
2 2024-10-01 02:00:00         10.0         10    C
3 2024-10-01 03:00:00          8.0         18    D
4 2024-10-01 04:00:00          1.0         10    E

In [23]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [24]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         14.0         12
1         13.0          3
2         10.0         10
3          8.0         18
4          1.0         10

In [25]:
df.select_dtypes(include='float')

   bil_pecahan
0         14.0
1         13.0
2         10.0
3          8.0
4          1.0

In [26]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1          3
2         10
3         18
4         10

In [27]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [28]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [29]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         14.0         12    A
1         13.0          3    B
2         10.0         10    C
3          8.0         18    D
4          1.0         10    E

In [30]:
#PART 5

In [31]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [32]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  5  7  6  5
1  8  9  8  1  6
2  3  9  6  7  7
3  6  3  4  1  1
4  9  1  6  6  4

In [33]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  6  7  5  1
1  6  1  8  9  8
2  7  7  6  9  3
3  1  1  4  3  6
4  4  6  6  1  9

In [34]:
df.loc[::-1]

   A  B  C  D  E
4  9  1  6  6  4
3  6  3  4  1  1
2  3  9  6  7  7
1  8  9  8  1  6
0  1  5  7  6  5

In [36]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  1  6  6  4
1  6  3  4  1  1
2  3  9  6  7  7
3  8  9  8  1  6
4  1  5  7  6  5

In [37]:
#PART 6

In [38]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [39]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  9  3  8  3  5
1  4  5  1  1  7
2  4  1  8  2  4
3  5  6  8  7  7
4  4  7  6  6  8

In [40]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  9  3     8  3  5
1  4  5     1  1  7
2  4  1     8  2  4
3  5  6     8  7  7
4  4  7     6  6  8

In [41]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     9       3  8     3  5
1     4       5  1     1  7
2     4       1  8     2  4
3     5       6  8     7  7
4     4       7  6     6  8

In [42]:
#PART 7

In [43]:
import pandas as pd

print(pd.__version__)

2.3.3

In [44]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0       NaN  1.071661  0.570889       NaN
1      1  1.359482  1.346241  0.163688  0.575390
2      2 -0.216235       NaN  0.067826 -0.311352
3      3  1.109669       NaN -0.083426       NaN
4      4 -0.269194  1.411866 -0.605601  2.320914

In [45]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0       NaN  1.071661  0.570889       NaN
1  1  1.359482  1.346241  0.163688  0.575390
2  2 -0.216235       NaN  0.067826 -0.311352
3  3  1.109669       NaN -0.083426       NaN
4  4 -0.269194  1.411866 -0.605601  2.320914

In [46]:
df_backup = df.copy(deep=True)

In [47]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [48]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
1    1  1.359482  1.346241  0.163688  0.575390
4    4 -0.269194  1.411866 -0.605601  2.320914
6    6 -0.771151  0.970647  0.305095  2.010668
11  11 -0.665606 -0.073549 -1.337584 -1.844689
13  13 -0.047348 -0.919368 -0.170751 -0.721677

In [49]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.333333
B    0.166667
C    0.066667
D    0.300000
dtype: float64

In [50]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         C
0  0  0.570889
1  1  0.163688
2  2  0.067826
3  3 -0.083426
4  4 -0.605601

In [51]:
#PART 8

In [52]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [53]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [54]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [55]:
type(df['A'])

pandas.core.series.Series

In [56]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [58]:
df['A'].equals(df['B'])

True

In [59]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [60]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True